Tekla Open API Reference for Tekla Structures 2025
BinaryFilterExpressionCollection.Remove Method
 Removes the first occurrence of a specific object from the collection.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Remove(
	BinaryFilterExpressionItem Item
)
Public Function Remove (
	Item As BinaryFilterExpressionItem
) As Boolean
Parameters
Item
Type: Tekla.Structures.Filtering.BinaryFilterExpressionItem
The object to remove from the collection. This value cannot be null.
Return Value
Type: Boolean
True if item was successfully removed. False otherwise.
Implements
ICollection<T>.Remove(T)
See Also
Reference
BinaryFilterExpressionCollection Class
Tekla.Structures.Filtering Namespace